// 障碍物
export const treeMap = [
    { x: 3, y: 6 },
    { x: 3, y: 7 },
    { x: 3, y: 8 },
    { x: 3, y: 9 },
    { x: 4, y: 4 },
    { x: 4, y: 5 },
    { x: 4, y: 6 },
    { x: 4, y: 9 },
    { x: 4, y: 10 },
    { x: 5, y: 4 },
    { x: 5, y: 10 },
    { x: 6, y: 4 },
    { x: 6, y: 6 },
    { x: 6, y: 10 },
    { x: 7, y: 4 },
    { x: 7, y: 6 },
    { x: 7, y: 8 },
    { x: 7, y: 9 },
    { x: 7, y: 10 },
    { x: 8, y: 4 },
    { x: 8, y: 6 },
    { x: 8, y: 10 },
    { x: 9, y: 4 },
    { x: 9, y: 10 },
    { x: 10, y: 4 },
    { x: 10, y: 5 },
    { x: 10, y: 10 },
    { x: 11, y: 5 },
    { x: 11, y: 8 },
    { x: 11, y: 9 },
    { x: 11, y: 10 },
    { x: 12, y: 5 },
    { x: 12, y: 6 },
    { x: 12, y: 7 },
    { x: 12, y: 8 },
]

// 目标点
export const tragetMap = [
    { x: 5, y: 8 },
    { x: 5, y: 9 },
    { x: 6, y: 8 },
    { x: 6, y: 9 },
]

// 箱子
export const boxMap = [
    { x: 5, y: 6 },
    { x: 7, y: 7 },
    { x: 9, y: 8 },
    { x: 10, y: 7 },
]

//英雄
export const heroMap = {
    x: 5,
    y: 7,
}